/*
 * @(#)AADLPrimitive.java	1.00	2007/11/29
 *     - created by Y.Ishizuka(PieCake.inc,)
 */
package ssac.aadlc.analysis.type;


/**
 * AADLプリミティブ型を表す基本クラス。
 * 
 * @version 1.00	2007/11/29
 */
public interface AADLPrimitive
{
	//------------------------------------------------------------
	// Definitions
	//------------------------------------------------------------

	//------------------------------------------------------------
	// Public interfaces
	//------------------------------------------------------------

}
