/*
 * @(#)FileUtil.java	1.16	2010/09/27
 *     - created by Y.Ishizuka(PieCake.inc,)
 */
package ssac.util.nio;

import java.io.IOException;

/**
 * ファイル操作ユーティリティ
 * 
 * @version 1.16	2010/09/27
 * @since 1.16
 */
public class FileUtil
{
	//------------------------------------------------------------
	// Constants
	//------------------------------------------------------------

	//------------------------------------------------------------
	// Fields
	//------------------------------------------------------------

	//------------------------------------------------------------
	// Constructions
	//------------------------------------------------------------
	
	private FileUtil() {}

	//------------------------------------------------------------
	// Public interfaces
	//------------------------------------------------------------

	/**
	 * 指定のストリームをクローズする。
	 * <br>
	 * このメソッドは例外を発生させない。
	 * 
	 * @param iCloseable クローズする <code>ICloseable</code> オブジェクト
	 */
	static public void closeStream(ICloseable iCloseable) {
		if (iCloseable != null) {
			try {
				iCloseable.close();
			}
			catch (IOException ex) {}
		}
	}

	//------------------------------------------------------------
	// Internal methods
	//------------------------------------------------------------

	//------------------------------------------------------------
	// Inner classes
	//------------------------------------------------------------
}
