/*
 * @(#)IModuleExecArgParam.java	1.00	2010/12/20
 *     - created by Y.Ishizuka(PieCake.inc,)
 */
package ssac.falconseed.module.args;

/**
 * モジュール実行定義のモジュール引数となる実行時可変パラメータの定義。
 * このインタフェースを保有するクラスは、不変オブジェクトであることを前提とする。
 * 
 * @version 1.00	2010/12/20
 */
public interface IMExecArgParam
{
	//------------------------------------------------------------
	// Constants
	//------------------------------------------------------------

	//------------------------------------------------------------
	// Interfaces
	//------------------------------------------------------------
}
