/*
 * @(#)CoordValue.java	3.3.0	2016/04/28
 *     - created by Y.Ishizuka(PieCake.inc,)
 */
package ssac.util.excel2csv.command.option;

/**
 * 変換定義における位置を示すオブジェクトの共通インタフェース。
 * 
 * @version 3.3.0
 * @since 3.3.0
 */
public interface CoordValue
{
	//------------------------------------------------------------
	// Constants
	//------------------------------------------------------------

	//------------------------------------------------------------
	// Interfaces
	//------------------------------------------------------------
}
