/*
 * @(#)GenericSchemaElementValidation.java	3.2.1	2015/07/21
 *     - created by Y.Ishizuka(PieCake.inc,)
 */
package ssac.falconseed.filter.generic.gui;

/**
 * 汎用フィルタのスキーマ定義データモデルの要素における値正当性チェック機能のインタフェースの基本的な実装。
 * 
 * @version 3.2.1
 * @since 3.2.1
 */
public class GenericSchemaElementValidationImpl extends AbGenericSchemaElementValidation
{
	//------------------------------------------------------------
	// Constants
	//------------------------------------------------------------

	//------------------------------------------------------------
	// Fields
	//------------------------------------------------------------

	//------------------------------------------------------------
	// Constructions
	//------------------------------------------------------------

	//------------------------------------------------------------
	// Public interfaces
	//------------------------------------------------------------

	//------------------------------------------------------------
	// Implements GenericSchemaElementValidation interfaces
	//------------------------------------------------------------

	/**
	 * このメソッドでは何も行わず、常に <tt>true</tt> を返す。
	 */
	@Override
	public boolean verify() {
		return true;
	}

	//------------------------------------------------------------
	// Internal methods
	//------------------------------------------------------------

	//------------------------------------------------------------
	// Inner classes
	//------------------------------------------------------------
}
